In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays ORDER BY song_id LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1618, 1542837407796, 15, 'paid', 'SOZCTXZ12AB0182364', 'AR5KOSW1187FB35FF4', 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 (3, 1542845526796, 15, 'paid', None, None, 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 (4, 1542845741796, 15, 'paid', None, None, 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 (2, 1542845350796, 15, 'paid', None, None, 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 (5, 1542846220796, 15, 'paid', None, None, 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(63, 'Ayla', 'Johnson', 'F', 'free'),
 (60, 'Devin', 'Larson', 'M', 'free'),
 (67, 'Colm', 'Santana', 'M', 'free'),
 (6, 'Cecilia', 'Owens', 'F', 'free'),
 (44, 'Aleena', 'Kirby', 'F', 'paid')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOMJBYD12A6D4F8557', 'Keepin It Real (Skit)', 'ARD0S291187B9B7BF5', 0, 114.78159),
 ('SOQHXMF12AB0182363', 'Young Boy Blues', 'ARGSJW91187B9B1D6B', 0, 218.77506),
 ('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, 233.40363),
 ('SOUDSGM12AC9618304', 'Insatiable (Instrumental Version)', 'ARNTLGG11E2835DDB9', 0, 266.39628),
 ('SOYMRWW12A6D4FAB14', 'The Moon And I (Ordinary Day Album Version)', 'ARKFYS91187B98E58F', 0, 267.7024)]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARD0S291187B9B7BF5', 'Rated R', 'Ohio', 'NaN', 'NaN'),
 ('ARGSJW91187B9B1D6B', 'JennyAnyKind', 'North Carolina', '35.219619999999999', '-80.019549999999995'),
 ('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', 'NaN', 'NaN'),
 ('ARNTLGG11E2835DDB9', 'Clp', '', 'NaN', 'NaN'),
 ('ARKFYS91187B98E58F', 'Jeff And Sheri Easter', '', 'NaN', 'NaN')]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1542845032796, 0, 22, 47, 11, 2018, 3),
 (1542845350796, 0, 22, 47, 11, 2018, 3),
 (1542845526796, 0, 22, 47, 11, 2018, 3),
 (1542845741796, 0, 22, 47, 11, 2018, 3),
 (1542846220796, 0, 22, 47, 11, 2018, 3)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

## ANALYIC QUERIES
### Most Active users

In [8]:
%sql SELECT u.first_name, u.last_name, u.gender, u.level, count(s.songplay_id) AS cnt \
FROM songplays s \
JOIN users u ON s.user_id=u.user_id \
GROUP BY u.user_id, u.first_name, u.last_name, u.gender, u.level \
ORDER BY cnt DESC LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('Chloe', 'Cuevas', 'F', 'paid', 689),
 ('Tegan', 'Levine', 'F', 'free', 665),
 ('Kate', 'Harrell', 'F', 'paid', 557),
 ('Lily', 'Koch', 'F', 'paid', 463),
 ('Aleena', 'Kirby', 'F', 'paid', 397)]

### Songplay activity by Gender

In [9]:
%sql SELECT u.gender, count(s.songplay_id) AS cnt \
FROM songplays s \
JOIN users u ON s.user_id=u.user_id \
GROUP BY u.gender \
ORDER BY cnt DESC LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
2 rows affected.

[('F', 4895), ('M', 1936)]

### Songplay activity by subscription Level

In [10]:
%sql SELECT u.level, count(s.songplay_id) AS cnt \
FROM songplays s \
JOIN users u ON s.user_id=u.user_id \
GROUP BY u.level \
ORDER BY cnt DESC LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
2 rows affected.

[('paid', 4547), ('free', 2284)]

### Most played song

In [11]:
%sql SELECT s.title, count(sp.songplay_id) AS cnt \
FROM songplays sp LEFT JOIN songs s ON sp.song_id=s.song_id \
GROUP BY s.title

 * postgresql://student:***@127.0.0.1/sparkifydb
2 rows affected.

[(None, 6830), ('Setanta matins', 1)]

### Analytic Result:
Most active users listening to music on sparkfy music streaming app are female with paid subscipions.

Only 1 record from the songplay logs were matched with the song/artist metadata

### Next Steps:
Import a more complete set of song/artist metadata from the `millionssongdataset` so a more informative analysis of the songs/artists being played on the sparkify app can be queried